# Merge DataFrames

In [1]:
import pandas as pd

In [2]:
temp_df = pd.DataFrame({
    'city' : ['mumbai', 'delhi', 'banglore', 'ranchi'],
    'temperature' : [32, 45, 30, 34]
})
temp_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30
3    ranchi           34

In [3]:
humidity_df = pd.DataFrame({
    'city' : ['delhi', 'mumbai', 'kolkata'],
    'humidity' : [80, 60, 75]
})
humidity_df

      city  humidity
0    delhi        80
1   mumbai        60
2  kolkata        75

In [4]:
df = pd.merge(temp_df, humidity_df, on='city')
df

     city  temperature  humidity
0  mumbai           32        60
1   delhi           45        80

In [5]:
# union of 2 sets
df = pd.merge(temp_df, humidity_df, on='city', how='outer')
df

       city  temperature  humidity
0    mumbai         32.0      60.0
1     delhi         45.0      80.0
2  banglore         30.0       NaN
3    ranchi         34.0       NaN
4   kolkata          NaN      75.0

In [6]:
# intersection of two sets
# by default how = inner
df = pd.merge(temp_df, humidity_df, on='city', how='inner')
df

     city  temperature  humidity
0  mumbai           32        60
1   delhi           45        80

In [7]:
df = pd.merge(temp_df, humidity_df, on='city', how='outer', indicator=True)
df

       city  temperature  humidity      _merge
0    mumbai         32.0      60.0        both
1     delhi         45.0      80.0        both
2  banglore         30.0       NaN   left_only
3    ranchi         34.0       NaN   left_only
4   kolkata          NaN      75.0  right_only

In [8]:
df1 = pd.DataFrame({
    'city' : ['mumbai', 'delhi', 'banglore', 'ranchi'],
    'temperature' : [32, 45, 30, 34],
    'humidity' : [80, 60, 75, 71]
})
df1

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        75
3    ranchi           34        71

In [9]:
df2 = pd.DataFrame({
    'city' : ['delhi', 'mumbai', 'kolkata'],
    'temperature' : [45, 30, 34],
    'humidity' : [80, 60, 75]
})
df2

      city  temperature  humidity
0    delhi           45        80
1   mumbai           30        60
2  kolkata           34        75

In [10]:
df3 = pd.merge(df1, df2, on='city')
df3

     city  temperature_x  humidity_x  temperature_y  humidity_y
0  mumbai             32          80             30          60
1   delhi             45          60             45          80

In [11]:
df3 = pd.merge(df1,df2, on='city', suffixes=('_left', '_right'))
df3

     city  temperature_left  humidity_left  temperature_right  humidity_right
0  mumbai                32             80                 30              60
1   delhi                45             60                 45              80